#
#   Brewfile
#   by Eliza Weisman
#

### taps ####################################################################
#tap 'billzajac/tap'

# tap 'hawkw/grub'
# tap 'hawkw/x86_64-pc-elf'

# tap 'osx-cross/avr'
# tap 'koekeishiya/formulae'
# tap 'neovim/neovim'
tap 'telemachus/desc'
tap 'thoughtbot/formulae'

### `brew install` packages #################################################
# these will be built from source
# brew 'a2ps'
brew 'ant'
brew 'archey'
brew 'gettext'
brew 'libffi'
brew 'pcre'
brew 'glib'
brew 'libpng'
brew 'freetype'
brew 'fontconfig'
brew 'pixman'
brew 'cairo'
brew 'pkg-config'
# brew 'gobject-introspection'
brew 'atk'
brew 'autoconf'
brew 'automake'
# brew 'libelf'
# brew 'libusb'
# brew 'libusb-compat'
# brew 'avrdude'
brew 'bazaar'
brew 'bdw-gc'
brew 'binutils'
brew 'boost'
brew 'gdbm'
brew 'openssl'
brew 'readline'
brew 'sqlite'
brew 'xz'
brew 'python3'
brew 'boost-python'
brew 'ghc'
brew 'cabal-install'
brew 'mono'
# brew 'ckan'
# brew 'cloc'
brew 'gmp'
brew 'isl'
brew 'cloog'
brew 'cmake'
brew 'colordiff'
brew 'coreutils'
brew 'mpfr'
brew 'gawk'
brew 'gnu-sed'
brew 'wget'
brew 'crosstool-ng'
brew 'ctags'
brew 'libgpg-error'
brew 'libassuan'
brew 'libgcrypt'
brew 'libksba'
brew 'pth'
brew 'dirmngr'
brew 'dos2unix'
brew 'dvdrtools'
brew 'eigen'
brew 'enscript'
brew 'jpeg'
brew 'libtiff'
brew 'wxmac'
brew 'erlang'
brew 'lame'
brew 'x264'
brew 'xvid'
brew 'ffmpeg'
brew 'flex'
brew 'libtool'
brew 'icu4c'
# brew 'harfbuzz'
brew 'pango'
brew 'fontforge'
brew 'libmpc'
brew 'gcc'
brew 'gdb', args: ['with-all-targets', 'with-python']
brew 'shared-mime-info'
# brew 'gdk-pixbuf'
# brew 'ghi'
# brew 'git-lfs'
# brew 'giter8'
# brew 'gnome-icon-theme'
brew 'pinentry'
brew 'gpg-agent'
brew 'gnupg2'
brew 'libtasn1'
brew 'nettle'
brew 'gnutls'
brew 'go'
brew 'gource'
brew 'gpgme'
brew 'gradle'
# brew 'graphviz'
# brew 'grub', args: ['HEAD', 'with-x86_64-pc-elf']
# brew 'gsettings-desktop-schemas'
# brew 'hicolor-icon-theme'
# brew 'gtk+'
# brew 'libepoxy'
# brew 'gtk+3'
# brew 'py2cairo'
# brew 'python'
# brew 'pygobject'
# brew 'pygtk'
# brew 'gtk-mac-integration'
# brew 'gtksourceview'
# brew 'gtksourceview3'
brew 'haskell-stack'
# brew 'heroku'
brew 'htop-osx'
brew 'hub'
brew 'ilmbase'
brew 'imagemagick'
brew 'intltool'
brew 'irssi'
brew 'ledger'
brew 'leiningen'
brew 'libevent'
brew 'libidn'
brew 'libotr'
brew 'libressl'
# brew 'libvo-aacenc'
# brew 'llvm'
brew 'loudmouth'
brew 'lynx'
brew 'mackup'
brew 'mas'
# brew 'maven'
brew 'mcabber'
brew 'md5sha1sum'
brew 'mercurial'
brew 'micro'
# brew 'minimal-racket'
brew 'protobuf'
# brew 'mobile-shell'
brew 'multitail'
brew 'nasm'
brew 'ncdu'
brew 'node'
brew 'neofetch'
brew 'netcat'
brew 'nghttp2'
brew 'nginx'
brew 'numpy'
brew 'objconv'
brew 'ocaml'
brew 'openexr'
brew 'pandoc'
brew 'pcre2'
# brew 'platformio'
brew 'ponyc'
brew 'portaudio'
brew 'pv'
brew 'pyenv'
# brew 'pygobject3'
# brew 'pygtksourceview'
brew 'qemu'
# brew 'ranger'
# brew 'rarian'
# brew 'reattach-to-user-namespace'
brew 'rlwrap'
# brew 'sbcl'
brew 'sbt'
brew 'scala'
brew 'scalastyle'
brew 'screenfetch'
brew 'sloccount'
brew 'slurm'
brew 'smlnj'
brew 'terminal-notifier'
# brew 'texi2html'
# brew 'the_silver_searcher'
brew 'tig'
brew 'utf8proc'
brew 'tmux'
brew 'tree'
brew 'unixodbc'
brew 'valgrind'
# brew 'w3m'
# brew 'weechat'
# brew 'xorriso'
# brew 'yasm'
brew 'zsh-completions'
brew 'jq'
brew 'java'
brew 'jupyter'
brew 'kubernetes-cli'
brew 'kubectx'
brew 'kubernetes-helm'
brew 'tcpflow'
brew 'telnet'

# packages from official Homebrew taps

# brew 'homebrew/boneyard/libiomp'
# brew 'homebrew/boneyard/clang-omp'
# brew 'homebrew/games/ckan'
# brew 'homebrew/games/nethack'
# brew 'homebrew/science/opencv'
# brew 'homebrew/science/r'

# packages from third party taps
#
# brew 'hawkw/x86_64-pc-elf/x86_64-pc-elf-binutils'
# brew 'hawkw/x86_64-pc-elf/x86_64-pc-elf-gcc'

# brew 'koekeishiya/formulae/kwm'
# brew 'neovim/neovim/neovim', args: ['HEAD']
brew 'thoughtbot/formulae/rcm'
brew "weaveworks/tap/eksctl"

### casks ###################################################################
# binary packages installed using Caskroom (https://caskroom.github.io)

tap 'caskroom/cask'
tap 'caskroom/versions'

cask 'alfred'
# cask 'atom-beta'

cask 'github-desktop'
# cask 'goofy'
cask 'haskell-platform'
# cask 'intellij-idea-eap'
cask 'visual-studio-code'
cask 'slack'
cask 'spotify'
# cask 'vagrant'
# cask 'x2goclient'
cask 'wireshark'


### fonts ###################################################################
# installed using https://github.com/caskroom/homebrew-fonts

cask 'font-iosevka'
cask 'font-iosevka-nerd-font'           # iosevka w/ nerd font support
cask 'font-iosevka-nerd-font-mono' # iosevka nerd font, monospace version

cask 'font-hack-nerd-font'

### Mac App Store ###########################################################

mas 'Dash', id: 449589707
# mas 'Dash', id: 458034879
mas 'Docs for Xcode', id: 688199928
# mas 'GarageBand', id: 682658836
# mas 'iMovie', id: 408981434
# mas 'Install macOS Sierra', id: 1127487414
# mas 'iPhoto', id: 408981381
# mas 'Keynote', id: 409183694
# mas 'LINE', id: 539883307
# mas 'Memory Cleaner', id: 748212890
# mas 'MemoryFreer', id: 451682720
# mas 'Mint QuickView', id: 533491939
# mas 'Monotony', id: 533978766
# mas 'Numbers', id: 409203825
# mas 'Pages', id: 409201541
# mas 'Parcel', id: 639968404
# mas 'Pulse Sensor', id: 974284569
mas 'QuickCursor', id: 404035899
mas 'Scrivener', id: 418889511
mas 'Sunrise Calendar', id: 886106985
# mas 'Telegram', id: 747648890
# mas 'TextWrangler', id: 404010395
mas 'The Unarchiver', id: 425424353
# mas 'Tumblr', id: 929285034
# mas 'WriteRoom', id: 417967324
mas 'Xcode', id: 497799835
